Continued plan output from previous comment.
<details><summary>Show Output</summary>

```diff
_permission.APIGetProjects: Refreshing state... [id=AllowAPIGetProjectsInvoke]
module.sbeacon.aws_api_gateway_integration.projects: Refreshing state... [id=agi-gh5prfe872-7uem7g-GET]
module.pgxflow[0].module.pipeline_pharmcat.aws_cloudwatch_event_target.update_references_trigger: Refreshing state... [id=pharmcat_update_references_trigger-lambda-pharmcat-updateReferenceFiles]
module.pgxflow[0].module.pipeline_pharmcat.aws_lambda_permission.cloudwatch_pharmcat_reference_update_permission: Refreshing state... [id=CloudwatchPharmcatReferenceUpdateAllowInvoke]
module.pgxflow[0].module.pipeline_lookup.aws_cloudwatch_event_target.update_references_trigger: Refreshing state... [id=lookup_update_references_trigger-lambda-lookup-updateReferenceFiles]
module.pgxflow[0].module.pipeline_lookup.aws_lambda_permission.cloudwatch_lookup_reference_update_permission: Refreshing state... [id=CloudwatchLookupReferenceUpdateAllowInvoke]
module.pgxflow[0].aws_api_gateway_integration_response.vcfstats-patch: Refreshing state... [id=agir-ia38r6jxwd-bpo9v8-PATCH-200]
module.sbeacon.aws_s3_bucket_notification.updateFiles: Refreshing state... [id=gaspi-dataportal20250331043651003800000004]
module.cognito.aws_cognito_user_in_group.admin_in_admin_group: Refreshing state... [id=ap-southeast-3_PXRtWWUqW,administrators,admin@example.com]
module.sbeacon.aws_api_gateway_integration_response.filtering_terms: Refreshing state... [id=agir-gh5prfe872-o6xsdd-GET-200]
module.sbeacon.data.aws_iam_policy_document.data-portal-lambda-access: Reading...
module.sbeacon.data.aws_iam_policy_document.data-portal-lambda-access: Read complete after 0s [id=2094140922]
module.sbeacon.module.cors-info-root.aws_api_gateway_method_response._: Refreshing state... [id=agmr-gh5prfe872-dn686w9ri2-OPTIONS-200]
module.sbeacon.module.cors-info-root.aws_api_gateway_integration._: Refreshing state... [id=agi-gh5prfe872-dn686w9ri2-OPTIONS]
module.pgxflow[0].aws_api_gateway_integration_response.qcnotes-post: Refreshing state... [id=agir-ia38r6jxwd-ai2mm8-POST-200]
module.pgxflow[0].aws_api_gateway_integration_response.qcnotes-get: Refreshing state... [id=agir-ia38r6jxwd-ai2mm8-GET-200]
module.pgxflow[0].aws_api_gateway_integration_response.vcfstats-post: Refreshing state... [id=agir-ia38r6jxwd-bpo9v8-POST-200]
module.sbeacon.aws_api_gateway_integration_response.root-get: Refreshing state... [id=agir-gh5prfe872-dn686w9ri2-GET-200]
module.sbeacon.aws_api_gateway_integration_response.info: Refreshing state... [id=agir-gh5prfe872-igeu2a-GET-200]
module.sbeacon.aws_api_gateway_integration_response.entry_types: Refreshing state... [id=agir-gh5prfe872-8pgh5n-GET-200]
module.sbeacon.module.lambda-splitQuery.aws_iam_role_policy.additional_json[0]: Refreshing state... [id=sbeacon-backend-splitQuery:sbeacon-backend-splitQuery]
module.sbeacon.module.cors-info-root.aws_api_gateway_integration_response._: Refreshing state... [id=agir-gh5prfe872-dn686w9ri2-OPTIONS-200]
module.sbeacon.module.lambda-data-portal.aws_iam_role_policy.additional_jsons[0]: Refreshing state... [id=sbeacon-backend-dataPortal:sbeacon-backend-dataPortal-0]
module.sbeacon.module.lambda-data-portal.aws_iam_role_policy.additional_jsons[1]: Refreshing state... [id=sbeacon-backend-dataPortal:sbeacon-backend-dataPortal-1]
module.sbeacon.module.lambda-splitQuery.aws_lambda_function.this[0]: Refreshing state... [id=sbeacon-backend-splitQuery]
module.sbeacon.module.lambda-admin.aws_lambda_function.this[0]: Refreshing state... [id=sbeacon-backend-admin]
module.pgxflow[0].module.pipeline_pharmcat.module.lambda-gnomad.aws_iam_role_policy.additional_jsons[0]: Refreshing state... [id=pgxflow-backend-pharmcat-gnomad:pgxflow-backend-pharmcat-gnomad-0]
module.pgxflow[0].module.pipeline_lookup.module.lambda-gnomad.aws_iam_role_policy.additional_jsons[0]: Refreshing state... [id=pgxflow-backend-gnomad:pgxflow-backend-gnomad-0]
module.sbeacon.aws_api_gateway_integration_response.projects: Refreshing state... [id=agir-gh5prfe872-7uem7g-GET-200]
module.sbeacon.module.lambda-data-portal.aws_lambda_function.this[0]: Refreshing state... [id=sbeacon-backend-dataPortal]
module.sbeacon.data.aws_iam_policy_document.lambda-getIndividuals: Reading...
module.sbeacon.data.aws_iam_policy_document.lambda-getIndividuals: Read complete after 0s [id=2800688573]
module.sbeacon.data.aws_iam_policy_document.lambda-getBiosamples: Reading...
module.sbeacon.data.aws_iam_policy_document.lambda-getBiosamples: Read complete after 0s [id=2800688573]
module.sbeacon.data.aws_iam_policy_document.lambda-getRuns: Reading...
module.sbeacon.data.aws_iam_policy_document.lambda-getRuns: Read complete after 0s [id=2800688573]
module.sbeacon.data.aws_iam_policy_document.lambda-getDatasets: Reading...
module.sbeacon.data.aws_iam_policy_document.lambda-getDatasets: Read complete after 0s [id=2800688573]
module.sbeacon.aws_sns_topic_subscription.splitQuery: Refreshing state... [id=arn:aws:sns:ap-southeast-3:557690600725:splitQuery:38b9ba2a-3c5c-487c-8ab7-f25697adfce5]
module.sbeacon.aws_lambda_permission.SNSsplitQuery: Refreshing state... [id=SBeaconBackendAllowSNSsplitQueryInvoke]
module.sbeacon.data.aws_iam_policy_document.lambda-getGenomicVariants: Reading...
module.sbeacon.data.aws_iam_policy_document.lambda-getGenomicVariants: Read complete after 0s [id=2722236234]
module.sbeacon.data.aws_iam_policy_document.lambda-getAnalyses: Reading...
module.sbeacon.data.aws_iam_policy_document.lambda-getAnalyses: Read complete after 0s [id=2800688573]
module.sbeacon.aws_api_gateway_integration.admin_proxy: Refreshing state... [id=agi-gh5prfe872-evdzq7-ANY]
module.sbeacon.aws_lambda_permission.APIadmin_proxy: Refreshing state... [id=AllowAPIadmin_proxyInvoke]
module.sbeacon.module.lambda-getIndividuals.aws_iam_role_policy.additional_jsons[2]: Refreshing state... [id=sbeacon-backend-getIndividuals:sbeacon-backend-getIndividuals-2]
module.sbeacon.module.lambda-getIndividuals.aws_iam_role_policy.additional_jsons[3]: Refreshing state... [id=sbeacon-backend-getIndividuals:sbeacon-backend-getIndividuals-3]
module.pgxflow[0].module.pipeline_pharmcat.module.lambda-gnomad.aws_lambda_function.this[0]: Refreshing state... [id=pgxflow-backend-pharmcat-gnomad]
module.sbeacon.module.lambda-getIndividuals.aws_iam_role_policy.additional_jsons[0]: Refreshing state... [id=sbeacon-backend-getIndividuals:sbeacon-backend-getIndividuals-0]
module.sbeacon.module.lambda-getIndividuals.aws_iam_role_policy.additional_jsons[1]: Refreshing state... [id=sbeacon-backend-getIndividuals:sbeacon-backend-getIndividuals-1]
module.sbeacon.module.lambda-getBiosamples.aws_iam_role_policy.additional_jsons[1]: Refreshing state... [id=sbeacon-backend-getBiosamples:sbeacon-backend-getBiosamples-1]
module.pgxflow[0].module.pipeline_lookup.module.lambda-gnomad.aws_lambda_function.this[0]: Refreshing state... [id=pgxflow-backend-gnomad]
module.sbeacon.module.lambda-getBiosamples.aws_iam_role_policy.additional_jsons[2]: Refreshing state... [id=sbeacon-backend-getBiosamples:sbeacon-backend-getBiosamples-2]
module.sbeacon.module.lambda-getBiosamples.aws_iam_role_policy.additional_jsons[3]: Refreshing state... [id=sbeacon-backend-getBiosamples:sbeacon-backend-getBiosamples-3]
module.sbeacon.module.lambda-getBiosamples.aws_iam_role_policy.additional_jsons[0]: Refreshing state... [id=sbeacon-backend-getBiosamples:sbeacon-backend-getBiosamples-0]
module.sbeacon.module.lambda-getDatasets.aws_iam_role_policy.additional_jsons[1]: Refreshing state... [id=sbeacon-backend-getDatasets:sbeacon-backend-getDatasets-1]
module.sbeacon.module.lambda-getDatasets.aws_iam_role_policy.additional_jsons[2]: Refreshing state... [id=sbeacon-backend-getDatasets:sbeacon-backend-getDatasets-2]
module.sbeacon.module.lambda-getDatasets.aws_iam_role_policy.additional_jsons[3]: Refreshing state... [id=sbeacon-backend-getDatasets:sbeacon-backend-getDatasets-3]
module.sbeacon.module.lambda-getDatasets.aws_iam_role_policy.additional_jsons[0]: Refreshing state... [id=sbeacon-backend-getDatasets:sbeacon-backend-getDatasets-0]
module.sbeacon.module.lambda-getAnalyses.aws_iam_role_policy.additional_jsons[2]: Refreshing state... [id=sbeacon-backend-getAnalyses:sbeacon-backend-getAnalyses-2]
module.sbeacon.module.lambda-getAnalyses.aws_iam_role_policy.additional_jsons[3]: Refreshing state... [id=sbeacon-backend-getAnalyses:sbeacon-backend-getAnalyses-3]
module.sbeacon.module.lambda-getAnalyses.aws_iam_role_policy.additional_jsons[0]: Refreshing state... [id=sbeacon-backend-getAnalyses:sbeacon-backend-getAnalyses-0]
module.sbeacon.module.lambda-getAnalyses.aws_iam_role_policy.additional_jsons[1]: Refreshing state... [id=sbeacon-backend-getAnalyses:sbeacon-backend-getAnalyses-1]
module.sbeacon.aws_lambda_permission.APIdportal_proxy: Refreshing state... [id=AllowAPIdportal_proxyInvoke]
module.sbeacon.module.lambda-getGenomicVariants.aws_iam_role_policy.additional_jsons[3]: Refreshing state... [id=sbeacon-backend-getGenomicVariants:sbeacon-backend-getGenomicVariants-3]
module.sbeacon.module.lambda-getGenomicVariants.aws_iam_role_policy.additional_jsons[0]: Refreshing state... [id=sbeacon-backend-getGenomicVariants:sbeacon-backend-getGenomicVariants-0]
module.sbeacon.module.lambda-getGenomicVariants.aws_iam_role_policy.additional_jsons[1]: Refreshing state... [id=sbeacon-backend-getGenomicVariants:sbeacon-backend-getGenomicVariants-1]
module.sbeacon.module.lambda-getGenomicVariants.aws_iam_role_policy.additional_jsons[2]: Refreshing state... [id=sbeacon-backend-getGenomicVariants:sbeacon-backend-getGenomicVariants-2]
module.sbeacon.module.lambda-getRuns.aws_iam_role_policy.additional_jsons[1]: Refreshing state... [id=sbeacon-backend-getRuns:sbeacon-backend-getRuns-1]
module.sbeacon.aws_api_gateway_integration.dportal_proxy: Refreshing state... [id=agi-gh5prfe872-ebz19c-ANY]
module.sbeacon.module.lambda-getRuns.aws_iam_role_policy.additional_jsons[2]: Refreshing state... [id=sbeacon-backend-getRuns:sbeacon-backend-getRuns-2]
module.sbeacon.module.lambda-getRuns.aws_iam_role_policy.additional_jsons[3]: Refreshing state... [id=sbeacon-backend-getRuns:sbeacon-backend-getRuns-3]
module.sbeacon.module.lambda-getRuns.aws_iam_role_policy.additional_jsons[0]: Refreshing state... [id=sbeacon-backend-getRuns:sbeacon-backend-getRuns-0]
module.sbeacon.aws_api_gateway_integration_response.admin_proxy: Refreshing state... [id=agir-gh5prfe872-evdzq7-ANY-200]
module.pgxflow[0].aws_api_gateway_deployment.PgxApi: Refreshing state... [id=th4ea5]
module.sbeacon.module.lambda-getIndividuals.aws_lambda_function.this[0]: Refreshing state... [id=sbeacon-backend-getIndividuals]
module.sbeacon.module.lambda-getBiosamples.aws_lambda_function.this[0]: Refreshing state... [id=sbeacon-backend-getBiosamples]
module.sbeacon.module.lambda-getDatasets.aws_lambda_function.this[0]: Refreshing state... [id=sbeacon-backend-getDatasets]
module.sbeacon.aws_api_gateway_integration_response.map: Refreshing state... [id=agir-gh5prfe872-bqautb-GET-200]
module.sbeacon.module.lambda-getAnalyses.aws_lambda_function.this[0]: Refreshing state... [id=sbeacon-backend-getAnalyses]
module.sbeacon.aws_api_gateway_integration_response.dportal_proxy: Refreshing state... [id=agir-gh5prfe872-ebz19c-ANY-200]
module.pgxflow[0].aws_api_gateway_stage.PgxApi: Refreshing state... [id=ags-ia38r6jxwd-prod]
module.sbeacon.module.lambda-getGenomicVariants.aws_lambda_function.this[0]: Refreshing state... [id=sbeacon-backend-getGenomicVariants]
module.sbeacon.module.lambda-getRuns.aws_lambda_function.this[0]: Refreshing state... [id=sbeacon-backend-getRuns]
module.sbeacon.aws_api_gateway_integration.individuals-filtering_terms_post: Refreshing state... [id=agi-gh5prfe872-04i7mj-POST]
module.sbeacon.aws_api_gateway_integration.individuals: Refreshing state... [id=agi-gh5prfe872-toqg0u-GET]
module.sbeacon.aws_api_gateway_integration.individuals_post: Refreshing state... [id=agi-gh5prfe872-toqg0u-POST]
module.sbeacon.aws_api_gateway_integration.individuals-id-g_variants_post: Refreshing state... [id=agi-gh5prfe872-ng48da-POST]
module.sbeacon.aws_api_gateway_integration.individuals-id-biosamples_post: Refreshing state... [id=agi-gh5prfe872-ix72om-POST]
module.sbeacon.aws_api_gateway_integration.individuals-id: Refreshing state... [id=agi-gh5prfe872-u99qoe-GET]
module.sbeacon.aws_api_gateway_integration.individuals-id-g_variants: Refreshing state... [id=agi-gh5prfe872-ng48da-GET]
module.sbeacon.aws_api_gateway_integration.individuals-filtering_terms: Refreshing state... [id=agi-gh5prfe872-04i7mj-GET]
module.sbeacon.aws_api_gateway_integration.individuals-id_post: Refreshing state... [id=agi-gh5prfe872-u99qoe-POST]
module.sbeacon.aws_api_gateway_integration.individuals-id-biosamples: Refreshing state... [id=agi-gh5prfe872-ix72om-GET]
module.sbeacon.aws_lambda_permission.APIindividualsFilteringTerms: Refreshing state... [id=AllowAPIindividualsFilteringTermsInvoke]
module.sbeacon.aws_lambda_permission.APIindividuals: Refreshing state... [id=AllowAPIindividualsInvoke]
module.sbeacon.aws_lambda_permission.APIindividualsIdbiosamples: Refreshing state... [id=AllowAPIindividualsIdbiosamplesInvoke]
module.sbeacon.aws_lambda_permission.APIindividualsId: Refreshing state... [id=AllowAPIindividualsIdInvoke]
module.sbeacon.aws_lambda_permission.APIindividualsIdg_variants: Refreshing state... [id=AllowAPIindividualsIdg_variantsInvoke]
module.sbeacon.aws_lambda_permission.APIbiosamplesIdruns: Refreshing state... [id=AllowAPIbiosamplesIdrunsInvoke]
module.sbeacon.aws_lambda_permission.APIbiosamplesIdanalyses: Refreshing state... [id=AllowAPIbiosamplesIdanalysesInvoke]
module.sbeacon.aws_lambda_permission.APIbiosamplesId: Refreshing state... [id=AllowAPIbiosamplesIdInvoke]
module.sbeacon.aws_lambda_permission.APIbiosamplesFilteringTerms: Refreshing state... [id=AllowAPIbiosamplesFilteringTermsInvoke]
module.sbeacon.aws_lambda_permission.APIbiosamples: Refreshing state... [id=AllowAPIbiosamplesInvoke]
module.sbeacon.aws_lambda_permission.APIbiosamplesIdg_variants: Refreshing state... [id=AllowAPIbiosamplesIdg_variantsInvoke]
module.sbeacon.aws_api_gateway_integration.biosamples: Refreshing state... [id=agi-gh5prfe872-xil2zq-GET]
module.sbeacon.aws_api_gateway_integration.biosamples-id-runs_post: Refreshing state... [id=agi-gh5prfe872-8vuzyh-POST]
module.sbeacon.aws_api_gateway_integration.biosamples-id-analyses: Refreshing state... [id=agi-gh5prfe872-x1329u-GET]
module.sbeacon.aws_api_gateway_integration.biosamples-id_post: Refreshing state... [id=agi-gh5prfe872-7d6nnu-POST]
module.sbeacon.aws_api_gateway_integration.biosamples-id-g_variants: Refreshing state... [id=agi-gh5prfe872-tzz7ht-GET]
module.sbeacon.aws_api_gateway_integration.biosamples-id: Refreshing state... [id=agi-gh5prfe872-7d6nnu-GET]
module.sbeacon.aws_api_gateway_integration.biosamples-id-runs: Refreshing state... [id=agi-gh5prfe872-8vuzyh-GET]
module.sbeacon.aws_api_gateway_integration.biosamples-id-analyses_post: Refreshing state... [id=agi-gh5prfe872-x1329u-POST]
module.sbeacon.aws_api_gateway_integration.biosamples-filtering_terms_post: Refreshing state... [id=agi-gh5prfe872-mi8486-POST]
module.sbeacon.aws_api_gateway_integration.biosamples-filtering_terms: Refreshing state... [id=agi-gh5prfe872-mi8486-GET]
module.pgxflow[0].module.pipeline_pharmcat.module.lambda-postprocessor.aws_iam_role_policy.additional_jsons[0]: Refreshing state... [id=pgxflow-backend-postprocessor:pgxflow-backend-postprocessor-0]
module.sbeacon.aws_api_gateway_integration.biosamples-id-g_variants_post: Refreshing state... [id=agi-gh5prfe872-tzz7ht-POST]
module.pgxflow[0].module.pipeline_lookup.module.lambda-lookup.aws_iam_role_policy.additional_jsons[0]: Refreshing state... [id=pgxflow-backend-lookup:pgxflow-backend-lookup-0]
module.sbeacon.aws_api_gateway_integration.biosamples_post: Refreshing state... [id=agi-gh5prfe872-xil2zq-POST]
module.pgxflow[0].aws_cloudfront_distribution.api_distribution: Refreshing state... [id=E1NHE0AK1MSZAG]
module.pgxflow[0].aws_api_gateway_method_settings.PgxApi: Refreshing state... [id=ia38r6jxwd-prod-*/*]
module.sbeacon.aws_api_gateway_integration_response.individuals-filtering_terms_post: Refreshing state... [id=agir-gh5prfe872-04i7mj-POST-200]
module.sbeacon.aws_api_gateway_integration_response.individuals: Refreshing state... [id=agir-gh5prfe872-toqg0u-GET-200]
module.sbeacon.aws_api_gateway_integration_response.individuals_post: Refreshing state... [id=agir-gh5prfe872-toqg0u-POST-200]
module.sbeacon.aws_api_gateway_integration_response.individuals-id-g_variants_post: Refreshing state... [id=agir-gh5prfe872-ng48da-POST-200]
module.sbeacon.aws_api_gateway_integration_response.individuals-id-biosamples_post: Refreshing state... [id=agir-gh5prfe872-ix72om-POST-200]
module.sbeacon.aws_api_gateway_integration_response.individuals-id-g_variants: Refreshing state... [id=agir-gh5prfe872-ng48da-GET-200]
module.sbeacon.aws_api_gateway_integration_response.individuals-id-biosamples: Refreshing state... [id=agir-gh5prfe872-ix72om-GET-200]
module.sbeacon.aws_api_gateway_integration_response.biosamples-id-runs_post: Refreshing state... [id=agir-gh5prfe872-8vuzyh-POST-200]
module.sbeacon.aws_api_gateway_integration_response.biosamples-id-analyses: Refreshing state... [id=agir-gh5prfe872-x1329u-GET-200]
module.sbeacon.aws_api_gateway_integration_response.biosamples-id_post: Refreshing state... [id=agir-gh5prfe872-7d6nnu-POST-200]
module.sbeacon.aws_api_gateway_integration_response.biosamples-id-g_variants: Refreshing state... [id=agir-gh5prfe872-tzz7ht-GET-200]
module.sbeacon.aws_api_gateway_integration_response.biosamples-id: Refreshing state... [id=agir-gh5prfe872-7d6nnu-GET-200]
module.sbeacon.aws_api_gateway_integration_response.biosamples-id-runs: Refreshing state... [id=agir-gh5prfe872-8vuzyh-GET-200]
module.sbeacon.aws_api_gateway_integration_response.individuals-filtering_terms: Refreshing state... [id=agir-gh5prfe872-04i7mj-GET-200]
module.sbeacon.aws_api_gateway_integration_response.individuals-id: Refreshing state... [id=agir-gh5prfe872-u99qoe-GET-200]
module.sbeacon.aws_api_gateway_integration_response.biosamples-id-analyses_post: Refreshing state... [id=agir-gh5prfe872-x1329u-POST-200]
module.sbeacon.aws_api_gateway_integration_response.biosamples-filtering_terms_post: Refreshing state... [id=agir-gh5prfe872-mi8486-POST-200]
module.pgxflow[0].module.pipeline_pharmcat.module.lambda-postprocessor.aws_lambda_function.this[0]: Refreshing state... [id=pgxflow-backend-postprocessor]
module.sbeacon.aws_api_gateway_integration_response.biosamples-id-g_variants_post: Refreshing state... [id=agir-gh5prfe872-tzz7ht-POST-200]
module.sbeacon.aws_api_gateway_integration.datasets-id-biosamples_post: Refreshing state... [id=agi-gh5prfe872-77nvhp-POST]
module.sbeacon.aws_api_gateway_integration.datasets-id-filtering_terms_post: Refreshing state... [id=agi-gh5prfe872-z6d7qk-POST]
module.sbeacon.aws_api_gateway_integration.datasets-id_post: Refreshing state... [id=agi-gh5prfe872-bz4sgj-POST]
module.sbeacon.aws_api_gateway_integration.datasets-id-filtering_terms: Refreshing state... [id=agi-gh5prfe872-z6d7qk-GET]
module.sbeacon.aws_api_gateway_integration.datasets-filtering_terms_post: Refreshing state... [id=agi-gh5prfe872-6wobu7-POST]
module.sbeacon.aws_api_gateway_integration.datasets-filtering_terms: Refreshing state... [id=agi-gh5prfe872-6wobu7-GET]
module.sbeacon.aws_api_gateway_integration.datasets-id: Refreshing state... [id=agi-gh5prfe872-bz4sgj-GET]
module.sbeacon.aws_api_gateway_integration.datasets-id-individuals_post: Refreshing state... [id=agi-gh5prfe872-h7987u-POST]
module.sbeacon.aws_api_gateway_integration.datasets-id-biosamples: Refreshing state... [id=agi-gh5prfe872-77nvhp-GET]
module.sbeacon.aws_api_gateway_integration.datasets: Refreshing state... [id=agi-gh5prfe872-phz80h-GET]
module.sbeacon.aws_api_gateway_integration.datasets-id-g_variants_post: Refreshing state... [id=agi-gh5prfe872-79sgpa-POST]
module.sbeacon.aws_api_gateway_integration.datasets-id-g_variants: Refreshing state... [id=agi-gh5prfe872-79sgpa-GET]
module.sbeacon.aws_api_gateway_integration.datasets_post: Refreshing state... [id=agi-gh5prfe872-phz80h-POST]
module.sbeacon.aws_api_gateway_integration.datasets-id-individuals: Refreshing state... [id=agi-gh5prfe872-h7987u-GET]
module.sbeacon.aws_lambda_permission.APIdatasetsId: Refreshing state... [id=AllowAPIdatasetsIdInvoke]
module.sbeacon.aws_lambda_permission.APIdatasetsIdbiosamples: Refreshing state... [id=AllowAPIdatasetsIdbiosamplesInvoke]
module.sbeacon.aws_lambda_permission.APIdatasetsIdg_variants: Refreshing state... [id=AllowAPIdatasetsIdg_variantsInvoke]
module.sbeacon.aws_lambda_permission.APIdatasetsIdfiltering_terms: Refreshing state... [id=AllowAPIdatasetsIdfiltering_termsInvoke]
module.sbeacon.aws_lambda_permission.APIdatasetsFilteringTerms: Refreshing state... [id=AllowAPIdatasetsFilteringTermsInvoke]
module.sbeacon.aws_lambda_permission.APIdatasetsIdindividuals: Refreshing state... [id=AllowAPIdatasetsIdindividualsInvoke]
module.sbeacon.aws_lambda_permission.APIdatasets: Refreshing state... [id=AllowAPIdatasetsInvoke]
module.sbeacon.aws_api_gateway_integration_response.biosamples_post: Refreshing state... [id=agir-gh5prfe872-xil2zq-POST-200]
module.sbeacon.aws_api_gateway_integration_response.individuals-id_post: Refreshing state... [id=agir-gh5prfe872-u99qoe-POST-200]
module.pgxflow[0].module.pipeline_lookup.module.lambda-lookup.aws_lambda_function.this[0]: Refreshing state... [id=pgxflow-backend-lookup]
module.sbeacon.aws_lambda_permission.APIanalysesIdg_variants: Refreshing state... [id=AllowAPIanalysesIdg_variantsInvoke]
module.sbeacon.aws_lambda_permission.APIanalysesFilteringTerms: Refreshing state... [id=AllowAPIanalysesFilteringTermsInvoke]
module.sbeacon.aws_lambda_permission.APIanalysesId: Refreshing state... [id=AllowAPIanalysesIdInvoke]
module.sbeacon.aws_lambda_permission.APIanalyses: Refreshing state... [id=AllowAPIanalysesInvoke]
module.sbeacon.aws_api_gateway_integration.analyses-id-g_variants_post: Refreshing state... [id=agi-gh5prfe872-id4j64-POST]
module.sbeacon.aws_api_gateway_integration.analyses-id_post: Refreshing state... [id=agi-gh5prfe872-pfkd7s-POST]
module.sbeacon.aws_api_gateway_integration.analyses-filtering_terms_post: Refreshing state... [id=agi-gh5prfe872-9to1fb-POST]
module.sbeacon.aws_api_gateway_integration.analyses_post: Refreshing state... [id=agi-gh5prfe872-pszltn-POST]
module.sbeacon.aws_api_gateway_integration.analyses: Refreshing state... [id=agi-gh5prfe872-pszltn-GET]
module.sbeacon.aws_api_gateway_integration.analyses-filtering_terms: Refreshing state... [id=agi-gh5prfe872-9to1fb-GET]
module.sbeacon.aws_api_gateway_integration.analyses-id: Refreshing state... [id=agi-gh5prfe872-pfkd7s-GET]
module.sbeacon.aws_api_gateway_integration.analyses-id-g_variants: Refreshing state... [id=agi-gh5prfe872-id4j64-GET]
module.sbeacon.aws_lambda_permission.APIruns: Refreshing state... [id=AllowAPIrunsInvoke]
module.sbeacon.aws_lambda_permission.APIrunsFilteringTerms: Refreshing state... [id=AllowAPIrunsFilteringTermsInvoke]
module.sbeacon.aws_lambda_permission.APIrunsIdg_variants: Refreshing state... [id=AllowAPIrunsIdg_variantsInvoke]
module.sbeacon.aws_lambda_permission.APIrunsIdanalyses: Refreshing state... [id=AllowAPIrunsIdanalysesInvoke]
module.sbeacon.aws_lambda_permission.APIrunsId: Refreshing state... [id=AllowAPIrunsIdInvoke]
module.sbeacon.aws_api_gateway_integration.runs-id-g_variants_post: Refreshing state... [id=agi-gh5prfe872-o6foff-POST]
module.sbeacon.aws_api_gateway_integration.runs-id: Refreshing state... [id=agi-gh5prfe872-xp2pn9-GET]
module.sbeacon.aws_api_gateway_integration.runs-id-analyses_post: Refreshing state... [id=agi-gh5prfe872-myeabw-POST]
module.sbeacon.aws_api_gateway_integration.runs: Refreshing state... [id=agi-gh5prfe872-dp09v9-GET]
module.sbeacon.aws_api_gateway_integration.runs_post: Refreshing state... [id=agi-gh5prfe872-dp09v9-POST]
module.sbeacon.aws_api_gateway_integration.runs-id-g_variants: Refreshing state... [id=agi-gh5prfe872-o6foff-GET]
module.sbeacon.aws_api_gateway_integration.runs-filtering_terms: Refreshing state... [id=agi-gh5prfe872-1lh8dq-GET]
module.sbeacon.aws_api_gateway_integration.runs-filtering_terms_post: Refreshing state... [id=agi-gh5prfe872-1lh8dq-POST]
module.sbeacon.aws_api_gateway_integration.runs-id_post: Refreshing state... [id=agi-gh5prfe872-xp2pn9-POST]
module.sbeacon.aws_api_gateway_integration.runs-id-analyses: Refreshing state... [id=agi-gh5prfe872-myeabw-GET]
module.sbeacon.aws_api_gateway_integration.g_variants-id-biosamples: Refreshing state... [id=agi-gh5prfe872-44w0o8-GET]
module.sbeacon.aws_api_gateway_integration.g_variants-id_post: Refreshing state... [id=agi-gh5prfe872-tuc20b-POST]
module.sbeacon.aws_api_gateway_integration.g_variants_post: Refreshing state... [id=agi-gh5prfe872-i8xyzu-POST]
module.sbeacon.aws_api_gateway_integration.g_variants-id-individuals_post: Refreshing state... [id=agi-gh5prfe872-bmrcjq-POST]
module.sbeacon.aws_api_gateway_integration.g_variants-id-biosamples_post: Refreshing state... [id=agi-gh5prfe872-44w0o8-POST]
module.sbeacon.aws_api_gateway_integration.g_variants-id-individuals: Refreshing state... [id=agi-gh5prfe872-bmrcjq-GET]
module.sbeacon.aws_api_gateway_integration.g_variants: Refreshing state... [id=agi-gh5prfe872-i8xyzu-GET]
module.sbeacon.aws_lambda_permission.APIg_variantsIdbiosamples: Refreshing state... [id=AllowAPIg_variantsIdbiosamplesInvoke]
module.sbeacon.aws_lambda_permission.APIg_variantsIdindividuals: Refreshing state... [id=AllowAPIg_variantsIdindividualsInvoke]
module.sbeacon.aws_lambda_permission.APIg_variants: Refreshing state... [id=AllowAPIg_variantsInvoke]
module.sbeacon.aws_lambda_permission.APIg_variantsId: Refreshing state... [id=AllowAPIg_variantsIdInvoke]
module.sbeacon.aws_api_gateway_integration_response.datasets-id-filtering_terms_post: Refreshing state... [id=agir-gh5prfe872-z6d7qk-POST-200]
module.sbeacon.aws_api_gateway_integration_response.datasets-id-filtering_terms: Refreshing state... [id=agir-gh5prfe872-z6d7qk-GET-200]
module.sbeacon.aws_api_gateway_integration_response.datasets-filtering_terms_post: Refreshing state... [id=agir-gh5prfe872-6wobu7-POST-200]
module.sbeacon.aws_api_gateway_integration_response.datasets-filtering_terms: Refreshing state... [id=agir-gh5prfe872-6wobu7-GET-200]
module.sbeacon.aws_api_gateway_integration_response.datasets-id: Refreshing state... [id=agir-gh5prfe872-bz4sgj-GET-200]
module.sbeacon.aws_api_gateway_integration_response.datasets-id-individuals_post: Refreshing state... [id=agir-gh5prfe872-h7987u-POST-200]
module.sbeacon.aws_api_gateway_integration_response.datasets-id-biosamples: Refreshing state... [id=agir-gh5prfe872-77nvhp-GET-200]
module.sbeacon.aws_api_gateway_integration_response.datasets: Refreshing state... [id=agir-gh5prfe872-phz80h-GET-200]
module.sbeacon.aws_api_gateway_integration_response.datasets-id_post: Refreshing state... [id=agir-gh5prfe872-bz4sgj-POST-200]
module.sbeacon.aws_api_gateway_integration_response.datasets-id-biosamples_post: Refreshing state... [id=agir-gh5prfe872-77nvhp-POST-200]
module.sbeacon.aws_api_gateway_integration_response.datasets_post: Refreshing state... [id=agir-gh5prfe872-phz80h-POST-200]
module.sbeacon.aws_api_gateway_integration_response.datasets-id-g_variants_post: Refreshing state... [id=agir-gh5prfe872-79sgpa-POST-200]
module.sbeacon.aws_api_gateway_integration_response.analyses-id-g_variants_post: Refreshing state... [id=agir-gh5prfe872-id4j64-POST-200]
module.sbeacon.aws_api_gateway_integration_response.analyses-id_post: Refreshing state... [id=agir-gh5prfe872-pfkd7s-POST-200]
module.sbeacon.aws_api_gateway_integration_response.analyses-filtering_terms_post: Refreshing state... [id=agir-gh5prfe872-9to1fb-POST-200]
module.sbeacon.aws_api_gateway_integration_response.analyses_post: Refreshing state... [id=agir-gh5prfe872-pszltn-POST-200]
module.sbeacon.aws_api_gateway_integration_response.analyses-filtering_terms: Refreshing state... [id=agir-gh5prfe872-9to1fb-GET-200]
module.sbeacon.aws_api_gateway_integration_response.analyses-id: Refreshing state... [id=agir-gh5prfe872-pfkd7s-GET-200]
module.sbeacon.aws_api_gateway_integration_response.analyses-id-g_variants: Refreshing state... [id=agir-gh5prfe872-id4j64-GET-200]
module.sbeacon.aws_api_gateway_integration_response.biosamples-filtering_terms: Refreshing state... [id=agir-gh5prfe872-mi8486-GET-200]
module.sbeacon.aws_api_gateway_integration_response.datasets-id-individuals: Refreshing state... [id=agir-gh5prfe872-h7987u-GET-200]
module.sbeacon.aws_api_gateway_integration_response.runs-id: Refreshing state... [id=agir-gh5prfe872-xp2pn9-GET-200]
module.sbeacon.aws_api_gateway_integration_response.runs: Refreshing state... [id=agir-gh5prfe872-dp09v9-GET-200]
module.sbeacon.aws_api_gateway_integration_response.runs-id-g_variants: Refreshing state... [id=agir-gh5prfe872-o6foff-GET-200]
module.sbeacon.aws_api_gateway_integration_response.runs-filtering_terms: Refreshing state... [id=agir-gh5prfe872-1lh8dq-GET-200]
module.sbeacon.aws_api_gateway_integration_response.runs-id-g_variants_post: Refreshing state... [id=agir-gh5prfe872-o6foff-POST-200]
module.sbeacon.aws_api_gateway_integration_response.runs-id_post: Refreshing state... [id=agir-gh5prfe872-xp2pn9-POST-200]
module.sbeacon.aws_api_gateway_integration_response.runs-id-analyses: Refreshing state... [id=agir-gh5prfe872-myeabw-GET-200]
module.sbeacon.aws_api_gateway_integration_response.g_variants-id-biosamples: Refreshing state... [id=agir-gh5prfe872-44w0o8-GET-200]
module.sbeacon.aws_api_gateway_integration_response.runs-id-analyses_post: Refreshing state... [id=agir-gh5prfe872-myeabw-POST-200]
module.sbeacon.aws_api_gateway_integration_response.biosamples: Refreshing state... [id=agir-gh5prfe872-xil2zq-GET-200]
module.sbeacon.aws_api_gateway_integration_response.g_variants-id_post: Refreshing state... [id=agir-gh5prfe872-tuc20b-POST-200]
module.sbeacon.aws_api_gateway_integration_response.g_variants_post: Refreshing state... [id=agir-gh5prfe872-i8xyzu-POST-200]
module.sbeacon.aws_api_gateway_integration_response.g_variants-id-individuals_post: Refreshing state... [id=agir-gh5prfe872-bmrcjq-POST-200]
module.sbeacon.aws_api_gateway_integration_response.g_variants: Refreshing state... [id=agir-gh5prfe872-i8xyzu-GET-200]
module.sbeacon.aws_api_gateway_integration_response.g_variants-id-biosamples_post: Refreshing state... [id=agir-gh5prfe872-44w0o8-POST-200]
module.sbeacon.aws_api_gateway_integration_response.runs-filtering_terms_post: Refreshing state... [id=agir-gh5prfe872-1lh8dq-POST-200]
module.sbeacon.aws_api_gateway_integration_response.datasets-id-g_variants: Refreshing state... [id=agir-gh5prfe872-79sgpa-GET-200]
module.sbeacon.aws_api_gateway_integration_response.g_variants-id-individuals: Refreshing state... [id=agir-gh5prfe872-bmrcjq-GET-200]
module.sbeacon.aws_api_gateway_integration_response.analyses: Refreshing state... [id=agir-gh5prfe872-pszltn-GET-200]
module.sbeacon.aws_api_gateway_integration_response.runs_post: Refreshing state... [id=agir-gh5prfe872-dp09v9-POST-200]
module.sbeacon.aws_api_gateway_integration_response.configuration: Refreshing state... [id=agir-gh5prfe872-sqd4cu-GET-200]
module.pgxflow[0].module.pipeline_pharmcat.module.lambda-pharmcat.aws_iam_role_policy.additional_jsons[0]: Refreshing state... [id=pgxflow-backend-pharmcat:pgxflow-backend-pharmcat-0]
module.pgxflow[0].module.pipeline_lookup.module.lambda-dbsnp.aws_iam_role_policy.additional_jsons[0]: Refreshing state... [id=pgxflow-backend-dbsnp:pgxflow-backend-dbsnp-0]
module.pgxflow[0].module.pipeline_pharmcat.module.lambda-pharmcat.aws_lambda_function.this[0]: Refreshing state... [id=pgxflow-backend-pharmcat]
module.pgxflow[0].module.pipeline_lookup.module.lambda-dbsnp.aws_lambda_function.this[0]: Refreshing state... [id=pgxflow-backend-dbsnp]
module.pgxflow[0].module.pipeline_pharmcat.aws_lambda_permission.LambdaPostprocessor: Refreshing state... [id=PGxFlowBackendAllowLambdaPostprocessorInvoke]
module.pgxflow[0].module.pipeline_pharmcat.module.lambda-preprocessor.aws_iam_role_policy.additional_jsons[0]: Refreshing state... [id=pgxflow-backend-preprocessor:pgxflow-backend-preprocessor-0]
module.pgxflow[0].module.pipeline_pharmcat.module.lambda-preprocessor.aws_lambda_function.this[0]: Refreshing state... [id=pgxflow-backend-preprocessor]
module.pgxflow[0].module.pipeline_pharmcat.aws_lambda_permission.LambdaPharmcat: Refreshing state... [id=PGxFlowBackendAllowLambdaPharmcatInvoke]
module.sbeacon.aws_api_gateway_method_response.g_variants-id: Refreshing state... [id=agmr-gh5prfe872-tuc20b-GET-200]
module.sbeacon.aws_api_gateway_integration.g_variants-id: Refreshing state... [id=agi-gh5prfe872-tuc20b-GET]
module.sbeacon.aws_api_gateway_integration_response.g_variants-id: Refreshing state... [id=agir-gh5prfe872-tuc20b-GET-200]
module.sbeacon.aws_api_gateway_deployment.BeaconApi: Refreshing state... [id=a58nvk]
module.sbeacon.aws_api_gateway_stage.BeaconApi: Refreshing state... [id=ags-gh5prfe872-prod]
module.sbeacon.aws_api_gateway_method_settings.BeaconApi: Refreshing state... [id=gh5prfe872-prod-*/*]
module.sbeacon.aws_cloudfront_distribution.api_distribution: Refreshing state... [id=EPZHGLJBN6AHB]
module.webgui.data.external.build: Reading...
module.webgui.aws_cloudfront_response_headers_policy.bui-security-headers-policy: Refreshing state... [id=cf46f0dd-5a72-4037-a1fd-3d413c19cf15]
module.webgui.aws_cloudfront_distribution.bui-s3-distribution: Refreshing state... [id=E229XF7DCD7860]
module.webgui.terraform_data.cloudfront-version-invalidate: Refreshing state... [id=e5382a08-ec2b-5bb9-a488-f8c3fd604367]
module.webgui.aws_ssm_parameter.bui-ssm-beacon-ui-url: Refreshing state... [id=bui-ssm-beacon-ui-url]
module.webgui.data.aws_iam_policy_document.s3_access_from_cloudfront: Reading...
module.webgui.data.aws_iam_policy_document.s3_access_from_cloudfront: Read complete after 0s [id=1679966834]
module.webgui.aws_s3_bucket_policy.s3_access_from_cloudfront: Refreshing state... [id=webgui-bucket-20250331043638413200000001]
module.webgui.data.external.build: Still reading... [10s elapsed]
module.webgui.data.external.build: Still reading... [20s elapsed]
module.webgui.data.external.build: Still reading... [30s elapsed]
module.webgui.data.external.build: Still reading... [40s elapsed]
module.webgui.data.external.build: Still reading... [50s elapsed]
module.webgui.data.external.build: Still reading... [1m0s elapsed]
module.webgui.data.external.build: Still reading... [1m10s elapsed]
module.webgui.data.external.build: Still reading... [1m20s elapsed]
module.webgui.data.external.build: Read complete after 1m29s [id=-]
module.webgui.null_resource.s3-upload: Refreshing state... [id=8497177962363326472]
module.webgui.null_resource.cloudfront-invalidate: Refreshing state... [id=6440902998886416547]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.pgxflow[0].archive_file.binaries_layer has changed
  ~ resource "archive_file" "binaries_layer" {
        id                  = "e82e2dba14d95056700ba94064000cdd6880c9a3"
      ~ output_base64sha256 = "F9WzE5IVDSxVoLUEvYSLE0CAoF0oUHXQHtJDXcLw9Qw=" -> "BaEnMjiyCHLaIWrea/iwA8NtFBiNbjJRCp9NI9+ILrY="
        # (9 unchanged attributes hidden)
    }

  # module.pgxflow[0].module.docker_image_qcFigures_lambda.docker_image.this has been deleted
  - resource "docker_image" "this" {
        id           = "sha256:d5a38bd9fc4d91155c077bea4488560ad42c80be3c6f8b94ee4e51683de5c2f5557690600725.dkr.ecr.ap-southeast-3.amazonaws.com/svep-qcfigures-lambda-containers"
      - image_id     = "sha256:d5a38bd9fc4d91155c077bea4488560ad42c80be3c6f8b94ee4e51683de5c2f5" -> null
      - name         = "557690600725.dkr.ecr.ap-southeast-3.amazonaws.com/svep-qcfigures-lambda-containers" -> null
        # (4 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.pgxflow[0].module.lambda-qcFigures.aws_lambda_function.this[0] has changed
  ~ resource "aws_lambda_function" "this" {
        id                             = "pgxflow-backend-qcFigures"
      ~ last_modified                  = "2025-07-11T00:47:54.000+0000" -> "2025-07-14T07:03:55.000+0000"
        tags                           = {
            "Environment"           = "dev"
            "NAME"                  = "pgxflow-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.docker_image_submitDataset_lambda.docker_image.this has been deleted
  - resource "docker_image" "this" {
        id           = "sha256:5bbdf7e427a272d06982f1993b996d3bda3c50aa4a358de10bb77b5ba2fe5bb3557690600725.dkr.ecr.ap-southeast-3.amazonaws.com/sbeacon-submitdataset-lambda-containers"
      - image_id     = "sha256:5bbdf7e427a272d06982f1993b996d3bda3c50aa4a358de10bb77b5ba2fe5bb3" -> null
      - name         = "557690600725.dkr.ecr.ap-southeast-3.amazonaws.com/sbeacon-submitdataset-lambda-containers" -> null
        # (4 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.pgxflow[0].module.pipeline_pharmcat.module.docker_image_pharmcat_lambda.docker_image.this has been deleted
  - resource "docker_image" "this" {
        id           = "sha256:7c29bb419151cf51128ed006a00bc6adbc12072d76c2651b5e0e55757ec41f14557690600725.dkr.ecr.ap-southeast-3.amazonaws.com/pgxflow-pharmcat-lambda-containers"
      - image_id     = "sha256:7c29bb419151cf51128ed006a00bc6adbc12072d76c2651b5e0e55757ec41f14" -> null
      - name         = "557690600725.dkr.ecr.ap-southeast-3.amazonaws.com/pgxflow-pharmcat-lambda-containers" -> null
        # (4 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.pgxflow[0].module.pipeline_pharmcat.module.docker_image_preprocessor_lambda.docker_image.this has been deleted
  - resource "docker_image" "this" {
        id           = "sha256:9c98f959eead75c1069d0330066ada5dac715d49270499d161b53b93466e583c557690600725.dkr.ecr.ap-southeast-3.amazonaws.com/pgxflow-preprocessor-lambda-containers"
      - image_id     = "sha256:9c98f959eead75c1069d0330066ada5dac715d49270499d161b53b93466e583c" -> null
      - name         = "557690600725.dkr.ecr.ap-southeast-3.amazonaws.com/pgxflow-preprocessor-lambda-containers" -> null
        # (4 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
-/+ destroy and then create replacement
+/- create replacement and then destroy
 <= read (data resources)

Terraform will perform the following actions:

  # module.cognito.aws_cognito_user_pool.gaspi_user_pool will be updated in-place
  ~ resource "aws_cognito_user_pool" "gaspi_user_pool" {
        id                         = "ap-southeast-3_PXRtWWUqW"
        name                       = "gaspi-users"
        tags                       = {
            "Environment" = "dev"
            "NAME"        = "cognito-infrastructure"
            "Owner"       = "gaspi"
        }
        # (18 unchanged attributes hidden)

      - schema {
          - attribute_data_type      = "String" -> null
          - developer_only_attribute = false -> null
          - mutable                  = true -> null
          - name                     = "identity_id" -> null
          - required                 = false -> null

          - string_attribute_constraints {}
        }
      + schema {
          + attribute_data_type      = "Boolean"
          + developer_only_attribute = false
          + mutable                  = true
          + name                     = "is_medical_director"
          + required                 = false
        }
      + schema {
          + attribute_data_type      = "String"
          + developer_only_attribute = false
          + mutable                  = true
          + name                     = "identity_id"
          + required                 = false

          + string_attribute_constraints {
                # (2 unchanged attributes hidden)
            }
        }

        # (9 unchanged blocks hidden)
    }

  # module.pgxflow[0].data.aws_iam_policy_document.lambda-initFlow will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "lambda-initFlow" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "s3:ListBucket",
            ]
          + resources = [
              + "arn:aws:s3:::gaspi-dataportal20250331043651003800000004",
            ]

          + condition {
              + test     = "StringLike"
              + values   = [
                  + "projects/*/project-files/*",
                ]
              + variable = "s3:prefix"
            }
        }
      + statement {
          + actions   = [
              + "s3:GetObject",
            ]
          + resources = [
              + "arn:aws:s3:::gaspi-dataportal20250331043651003800000004/projects/*/project-files/*",
              + "arn:aws:s3:::pgxflow-backend-references-20250516044449116600000003/*",
            ]
        }
      + statement {
          + actions   = [
              + "dynamodb:GetItem",
            ]
          + resources = [
              + "arn:aws:dynamodb:ap-southeast-3:557690600725:table/pgxflow-references",
              + "arn:aws:dynamodb:ap-southeast-3:557690600725:table/sbeacon-dataportal-project-users",
            ]
        }
      + statement {
          + actions   = [
              + "dynamodb:GetItem",
              + "dynamodb:PutItem",
              + "dynamodb:UpdateItem",
            ]
          + resources = [
              + "arn:aws:dynamodb:ap-southeast-3:557690600725:table/sbeacon-dataportal-clinic-jobs",
            ]
        }
      + statement {
          + actions   = [
              + "sns:Publish",
            ]
          + resources = [
              + (known after apply),
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "lambda:InvokeFunction",
            ]
          + resources = [
              + (known after apply),
            ]
        }
    }

  # module.pgxflow[0].aws_api_gateway_deployment.PgxApi must be replaced
+/- resource "aws_api_gateway_deployment" "PgxApi" {
      ~ created_date = "2025-07-08T00:09:23Z" -> (known after apply)
      ~ id           = "th4ea5" -> (known after apply)
      ~ triggers     = {
          - "redeployment" = "7f3e76090b20515e63ed7d789740cc21940196bc"
        } -> (known after apply) # forces replacement
        # (3 unchanged attributes hidden)
    }

  # module.pgxflow[0].aws_api_gateway_integration.results-get will be created
  + resource "aws_api_gateway_integration" "results-get" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "GET"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + region                  = "ap-southeast-3"
      + resource_id             = (known after apply)
      + rest_api_id             = "ia38r6jxwd"
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = (known after apply)
    }

  # module.pgxflow[0].aws_api_gateway_integration.results-options will be created
  + resource "aws_api_gateway_integration" "results-options" {
      + cache_namespace      = (known after apply)
      + connection_type      = "INTERNET"
      + http_method          = "OPTIONS"
      + id                   = (known after apply)
      + passthrough_behavior = (known after apply)
      + region               = "ap-southeast-3"
      + request_templates    = {
          + "application/json" = <<-EOT
                {
                        "statusCode": 200
                      }
            EOT
        }
      + resource_id          = (known after apply)
      + rest_api_id          = "ia38r6jxwd"
      + timeout_milliseconds = 29000
      + type                 = "MOCK"
    }

  # module.pgxflow[0].aws_api_gateway_integration.submit-options will be created
  + resource "aws_api_gateway_integration" "submit-options" {
      + cache_namespace      = (known after apply)
      + connection_type      = "INTERNET"
      + http_method          = "OPTIONS"
      + id                   = (known after apply)
      + passthrough_behavior = (known after apply)
      + region               = "ap-southeast-3"
      + request_templates    = {
          + "application/json" = <<-EOT
                {
                        "statusCode": 200
                      }
            EOT
        }
      + resource_id          = (known after apply)
      + rest_api_id          = "ia38r6jxwd"
      + timeout_milliseconds = 29000
      + type                 = "MOCK"
    }

  # module.pgxflow[0].aws_api_gateway_integration.submit-patch will be created
  + resource "aws_api_gateway_integration" "submit-patch" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "PATCH"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + region                  = "ap-southeast-3"
      + resource_id             = (known after apply)
      + rest_api_id             = "ia38r6jxwd"
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = (known after apply)
    }

  # module.pgxflow[0].aws_api_gateway_integration.submit-post will be created
  + resource "aws_api_gateway_integration" "submit-post" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "POST"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + region                  = "ap-southeast-3"
      + resource_id             = (known after apply)
      + rest_api_id             = "ia38r6jxwd"
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = (known after apply)
    }

  # module.pgxflow[0].aws_api_gateway_integration_response.results-get will be created
  + resource "aws_api_gateway_integration_response" "results-get" {
      + http_method        = "GET"
      + id                 = (known after apply)
      + region             = "ap-southeast-3"
      + resource_id        = (known after apply)
      + response_templates = {
          + "application/json" = null
        }
      + rest_api_id        = "ia38r6jxwd"
      + status_code        = "200"
    }

  # module.pgxflow[0].aws_api_gateway_integration_response.results-options will be created
  + resource "aws_api_gateway_integration_response" "results-options" {
      + http_method         = "OPTIONS"
      + id                  = (known after apply)
      + region              = "ap-southeast-3"
      + resource_id         = (known after apply)
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Headers" = "'Content-Type,X-Amz-Date,Authorization,X-Api-Key,X-Amz-Security-Token'"
          + "method.response.header.Access-Control-Allow-Methods" = "'OPTIONS,GET'"
          + "method.response.header.Access-Control-Allow-Origin"  = "'*'"
        }
      + response_templates  = {
          + "application/json" = null
        }
      + rest_api_id         = "ia38r6jxwd"
      + status_code         = "200"
    }

  # module.pgxflow[0].aws_api_gateway_integration_response.submit-options will be created
  + resource "aws_api_gateway_integration_response" "submit-options" {
      + http_method         = "OPTIONS"
      + id                  = (known after apply)
      + region              = "ap-southeast-3"
      + resource_id         = (known after apply)
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Headers" = "'Content-Type,X-Amz-Date,Authorization,X-Api-Key,X-Amz-Security-Token'"
          + "method.response.header.Access-Control-Allow-Methods" = "'OPTIONS,PATCH,POST'"
          + "method.response.header.Access-Control-Allow-Origin"  = "'*'"
        }
      + response_templates  = {
          + "application/json" = null
        }
      + rest_api_id         = "ia38r6jxwd"
      + status_code         = "200"
    }

  # module.pgxflow[0].aws_api_gateway_integration_response.submit-patch will be created
  + resource "aws_api_gateway_integration_response" "submit-patch" {
      + http_method        = "PATCH"
      + id                 = (known after apply)
      + region             = "ap-southeast-3"
      + resource_id        = (known after apply)
      + response_templates = {
          + "application/json" = null
        }
      + rest_api_id        = "ia38r6jxwd"
      + status_code        = "200"
    }

  # module.pgxflow[0].aws_api_gateway_integration_response.submit-post will be created
  + resource "aws_api_gateway_integration_response" "submit-post" {
      + http_method        = "POST"
      + id                 = (known after apply)
      + region             = "ap-southeast-3"
      + resource_id        = (known after apply)
      + response_templates = {
          + "application/json" = null
        }
      + rest_api_id        = "ia38r6jxwd"
      + status_code        = "200"
    }

  # module.pgxflow[0].aws_api_gateway_method.results-get will be created
  + resource "aws_api_gateway_method" "results-get" {
      + api_key_required = false
      + authorization    = "COGNITO_USER_POOLS"
      + authorizer_id    = "xzsms7"
      + http_method      = "GET"
      + id               = (known after apply)
      + region           = "ap-southeast-3"
      + resource_id      = (known after apply)
      + rest_api_id      = "ia38r6jxwd"
    }

  # module.pgxflow[0].aws_api_gateway_method.results-options will be created
  + resource "aws_api_gateway_method" "results-options" {
      + api_key_required = false
      + authorization    = "NONE"
      + http_method      = "OPTIONS"
      + id               = (known after apply)
      + region           = "ap-southeast-3"
      + resource_id      = (known after apply)
      + rest_api_id      = "ia38r6jxwd"
    }

  # module.pgxflow[0].aws_api_gateway_method.submit-options will be created
  + resource "aws_api_gateway_method" "submit-options" {
      + api_key_required = false
      + authorization    = "NONE"
      + http_method      = "OPTIONS"
      + id               = (known after apply)
      + region           = "ap-southeast-3"
      + resource_id      = (known after apply)
      + rest_api_id      = "ia38r6jxwd"
    }

  # module.pgxflow[0].aws_api_gateway_method.submit-patch will be created
  + resource "aws_api_gateway_method" "submit-patch" {
      + api_key_required = false
      + authorization    = "COGNITO_USER_POOLS"
      + authorizer_id    = "xzsms7"
      + http_method      = "PATCH"
      + id               = (known after apply)
      + region           = "ap-southeast-3"
      + resource_id      = (known after apply)
      + rest_api_id      = "ia38r6jxwd"
    }

  # module.pgxflow[0].aws_api_gateway_method.submit-post will be created
  + resource "aws_api_gateway_method" "submit-post" {
      + api_key_required = false
      + authorization    = "COGNITO_USER_POOLS"
      + authorizer_id    = "xzsms7"
      + http_method      = "POST"
      + id               = (known after apply)
      + region           = "ap-southeast-3"
      + resource_id      = (known after apply)
      + rest_api_id      = "ia38r6jxwd"
    }

  # module.pgxflow[0].aws_api_gateway_method_response.results-get will be created
  + resource "aws_api_gateway_method_response" "results-get" {
      + http_method         = "GET"
      + id                  = (known after apply)
      + region              = "ap-southeast-3"
      + resource_id         = (known after apply)
      + response_models     = {
          + "application/json" = "Empty"
        }
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Origin" = true
        }
      + rest_api_id         = "ia38r6jxwd"
      + status_code         = "200"
    }

  # module.pgxflow[0].aws_api_gateway_method_response.results-options will be created
  + resource "aws_api_gateway_method_response" "results-options" {
      + http_method         = "OPTIONS"
      + id                  = (known after apply)
      + region              = "ap-southeast-3"
      + resource_id         = (known after apply)
      + response_models     = {
          + "application/json" = "Empty"
        }
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Headers" = true
          + "method.response.header.Access-Control-Allow-Methods" = true
          + "method.response.header.Access-Control-Allow-Origin"  = true
        }
      + rest_api_id         = "ia38r6jxwd"
      + status_code         = "200"
    }

  # module.pgxflow[0].aws_api_gateway_method_response.submit-options will be created
  + resource "aws_api_gateway_method_response" "submit-options" {
      + http_method         = "OPTIONS"
      + id                  = (known after apply)
      + region              = "ap-southeast-3"
      + resource_id         = (known after apply)
      + response_models     = {
          + "application/json" = "Empty"
        }
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Headers" = true
          + "method.response.header.Access-Control-Allow-Methods" = true
          + "method.response.header.Access-Control-Allow-Origin"  = true
        }
      + rest_api_id         = "ia38r6jxwd"
      + status_code         = "200"
    }

  # module.pgxflow[0].aws_api_gateway_method_response.submit-patch will be created
  + resource "aws_api_gateway_method_response" "submit-patch" {
      + http_method         = "PATCH"
      + id                  = (known after apply)
      + region              = "ap-southeast-3"
      + resource_id         = (known after apply)
      + response_models     = {
          + "application/json" = "Empty"
        }
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Origin" = true
        }
      + rest_api_id         = "ia38r6jxwd"
      + status_code         = "200"
    }

  # module.pgxflow[0].aws_api_gateway_method_response.submit-post will be created
  + resource "aws_api_gateway_method_response" "submit-post" {
      + http_method         = "POST"
      + id                  = (known after apply)
      + region              = "ap-southeast-3"
      + resource_id         = (known after apply)
      + response_models     = {
          + "application/json" = "Empty"
        }
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Origin" = true
        }
      + rest_api_id         = "ia38r6jxwd"
      + status_code         = "200"
    }

  # module.pgxflow[0].aws_api_gateway_resource.results will be created
  + resource "aws_api_gateway_resource" "results" {
      + id          = (known after apply)
      + parent_id   = "co8rxso68c"
      + path        = (known after apply)
      + path_part   = "results"
      + region      = "ap-southeast-3"
      + rest_api_id = "ia38r6jxwd"
    }

  # module.pgxflow[0].aws_api_gateway_resource.submit will be created
  + resource "aws_api_gateway_resource" "submit" {
      + id          = (known after apply)
      + parent_id   = "co8rxso68c"
      + path        = (known after apply)
      + path_part   = "submit"
      + region      = "ap-southeast-3"
      + rest_api_id = "ia38r6jxwd"
    }

  # module.pgxflow[0].aws_api_gateway_stage.PgxApi will be updated in-place
  ~ resource "aws_api_gateway_stage" "PgxApi" {
      ~ deployment_id         = "th4ea5" -> (known after apply)
        id                    = "ags-ia38r6jxwd-prod"
        tags                  = {}
        # (15 unchanged attributes hidden)
    }

  # module.pgxflow[0].aws_lambda_layer_version.binaries_layer must be replaced
+/- resource "aws_lambda_layer_version" "binaries_layer" {
      ~ arn                         = "arn:aws:lambda:ap-southeast-3:557690600725:layer:pgxflow_backend_binaries_layer:13" -> (known after apply)
      ~ code_sha256                 = "F9WzE5IVDSxVoLUEvYSLE0CAoF0oUHXQHtJDXcLw9Qw=" -> (known after apply)
      - compatible_architectures    = [] -> null
      ~ created_date                = "2025-07-07T23:39:30.799+0000" -> (known after apply)
      ~ id                          = "arn:aws:lambda:ap-southeast-3:557690600725:layer:pgxflow_backend_binaries_layer:13" -> (known after apply)
      ~ layer_arn                   = "arn:aws:lambda:ap-southeast-3:557690600725:layer:pgxflow_backend_binaries_layer" -> (known after apply)
      + signing_job_arn             = (known after apply)
      + signing_profile_version_arn = (known after apply)
      ~ source_code_hash            = "F9WzE5IVDSxVoLUEvYSLE0CAoF0oUHXQHtJDXcLw9Qw=" -> "BaEnMjiyCHLaIWrea/iwA8NtFBiNbjJRCp9NI9+ILrY=" # forces replacement
      ~ source_code_size            = 15159210 -> (known after apply)
      ~ version                     = "13" -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.pgxflow[0].aws_lambda_permission.getresultsurl_invoke_permission will be created
  + resource "aws_lambda_permission" "getresultsurl_invoke_permission" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "pgxflow-backend-getResultsURL"
      + id                  = (known after apply)
      + principal           = "apigateway.amazonaws.com"
      + region              = "ap-southeast-3"
      + source_arn          = "arn:aws:execute-api:ap-southeast-3:557690600725:ia38r6jxwd/*/*/results"
      + statement_id        = "AllowAPIGetResultsURLInvoke"
      + statement_id_prefix = (known after apply)
    }

  # module.pgxflow[0].aws_lambda_permission.initflow_invoke_permission will be created
  + resource "aws_lambda_permission" "initflow_invoke_permission" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "pgxflow-backend-initFlow"
      + id                  = (known after apply)
      + principal           = "apigateway.amazonaws.com"
      + region              = "ap-southeast-3"
      + source_arn          = "arn:aws:execute-api:ap-southeast-3:557690600725:ia38r6jxwd/*/*/submit"
      + statement_id        = "AllowAPIInitFlowInvoke"
      + statement_id_prefix = (known after apply)
    }

  # module.sbeacon.data.archive_file.binaries_layer will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "archive_file" "binaries_layer" {
      + id                  = (known after apply)
      + output_base64sha256 = (known after apply)
      + output_base64sha512 = (known after apply)
      + output_md5          = (known after apply)
      + output_path         = "sbeacon/binaries.zip"
      + output_sha          = (known after apply)
      + output_sha256       = (known after apply)
      + output_sha512       = (known after apply)
      + output_size         = (known after apply)
      + source_dir          = "sbeacon/layers/binaries/"
      + type                = "zip"
    }

  # module.sbeacon.aws_lambda_layer_version.binaries_layer must be replaced
+/- resource "aws_lambda_layer_version" "binaries_layer" {
      ~ arn                         = "arn:aws:lambda:ap-southeast-3:557690600725:layer:sbeacon_backend_binaries_layer:8" -> (known after apply)
      ~ code_sha256                 = "71NiWqP3U5ih82AoIxW4bqbBkSw5C4vjr0AFO2E3x2M=" -> (known after apply)
      - compatible_architectures    = [] -> null
      ~ created_date                = "2025-07-07T23:40:17.062+0000" -> (known after apply)
      ~ id                          = "arn:aws:lambda:ap-southeast-3:557690600725:layer:sbeacon_backend_binaries_layer:8" -> (known after apply)
      ~ layer_arn                   = "arn:aws:lambda:ap-southeast-3:557690600725:layer:sbeacon_backend_binaries_layer" -> (known after apply)
      + signing_job_arn             = (known after apply)
      + signing_profile_version_arn = (known after apply)
      ~ source_code_hash            = "1Y0NrsUZplEqkXxPkj3SxjbrvcklrdwEPGTBd1PhvT+tGLjYlfGFKELcjuGR43Rq1WXLIZlkeEoK2Ekh72Uqjg==" -> (known after apply) # forces replacement
      ~ source_code_size            = 18422443 -> (known after apply)
      ~ version                     = "8" -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.sbeacon.aws_s3_bucket_notification.updateFiles will be updated in-place
  ~ resource "aws_s3_bucket_notification" "updateFiles" {
      ~ eventbridge = true -> false
        id          = "gaspi-dataportal20250331043651003800000004"
        # (2 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.sbeacon.null_resource.init_script must be replaced
+/- resource "null_resource" "init_script" {
      ~ id       = "43734844844841435" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "script_hash" = "2fd01ae235e903cd1abfd015bc9151fcfd1d6322" -> "fae82dadb80f46eacffb27e35880738cb715d327"
        }
    }

  # module.webgui.aws_s3_object.version will be updated in-place
  ~ resource "aws_s3_object" "version" {
      ~ content                       = "v0.17.1-alpha" -> "v0.17.1-alpha-72-gf45a8cb+"
        id                            = "version.txt"
        tags                          = {}
      + version_id                    = (known after apply)
        # (25 unchanged attributes hidden)
    }

  # module.webgui.null_resource.cloudfront-invalidate must be replaced
-/+ resource "null_resource" "cloudfront-invalidate" {
      ~ id       = "6440902998886416547" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "compiled_code_hash" = "a07bc7f093e7dcb41bb6e1f44b6fbad84bd766ee" -> "344335c909fa563f6dc9b9db0f68bf9c6adbc795"
        }
    }

  # module.webgui.null_resource.s3-upload must be replaced
-/+ resource "null_resource" "s3-upload" {
      ~ id       = "8497177962363326472" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "build_file_hash"    = "892f738d6a75c9a463120bba9ae1147b02f43b74" -> "e51dec655609c232d7ff7295fb65c90d4c440ad8"
          ~ "compiled_code_hash" = "a07bc7f093e7dcb41bb6e1f44b6fbad84bd766ee" -> "344335c909fa563f6dc9b9db0f68bf9c6adbc795"
        }
    }

  # module.webgui.terraform_data.cloudfront-version-invalidate must be replaced
-/+ resource "terraform_data" "cloudfront-version-invalidate" {
      ~ id               = "e5382a08-ec2b-5bb9-a488-f8c3fd604367" -> (known after apply)
      ~ triggers_replace = [
          ~ "v0.17.1-alpha" -> "v0.17.1-alpha-72-gf45a8cb+",
        ]
    }

  # module.cognito.module.lambda-customMessageLambdaTrigger.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "8814814475174376741" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1749694101000000000" -> "1753773243067708000"
            # (1 unchanged element hidden)
        }
    }

  # module.cognito.module.lambda-logEmailDelivery.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "1335287156747890711" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1749694102000000000" -> "1753773242839283000"
            # (1 unchanged element hidden)
        }
    }

  # module.cognito.module.lambda-sendClinicJobEmail.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "1093673705686607477" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1751931211000000000" -> "1753773242456552000"
            # (1 unchanged element hidden)
        }
    }

  # module.cognito.module.lambda-sendRegistrationEmail.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "3839308731460321587" -> (know
```
</details>
<br>

**Warning**: Output length greater than max comment size. Continued in next comment.